/**
 * Package for creational patterns
 *
 * Порождающие шаблоны — Шаблоны проектирования, которые абстрагируют процесс инстанцирования.
 * Они позволяют сделать систему независимой от способа создания, композиции и представления объектов.
 * Шаблон, порождающий классы, использует наследование, чтобы изменять наследуемый класс,
 * а шаблон, порождающий объекты, делегирует инстанцирование другому объекту.
 *
 * Если говорить простыми словами,
 * то это шаблоны, которые предназначены для создания экземпляра объекта или группы связанных объектов.
 *
 * @author Igor Fedorenko (mailto:if.zommy@gmail.com)
 * @version $Id$
 * @since 0.1
 */
package ru.job4j.patterns.creational;