
/**
 * Package for structural patterns
 *
 * Структурные шаблоны — шаблоны проектирования,
 * в которых рассматривается вопрос о том, как из классов и объектов образуются более крупные структуры.
 *
 * Простыми словами: Структурные шаблоны в основном связаны с композицией объектов,
 * другими словами, с тем, как сущности могут использовать друг друга.
 * Ещё одним объяснением было бы то, что они помогают ответить на вопрос «Как создать программный компонент?».
 *
 * Данные шаблоны позволяют определять взаимодействие между классами и объектами.
 * Т.е. определяют как образуются системы взаимодействуюших между собой объектов и классов.
 * @author Igor Fedorenko (mailto:if.zommy@gmail.com)
 * @version $Id$
 * @since 0.1
 */
package ru.job4j.patterns.structural;