/**
 * Package for behavioral patterns
 *
 * Поведенческие шаблоны — шаблоны проектирования,
 * определяющие алгоритмы и способы реализации взаимодействия различных объектов и классов.
 *
 * Простыми словами: Поведенческие шаблоны связаны с распределением обязанностей между объектами.
 * Их отличие от структурных шаблонов заключается в том, что они не просто описывают структуру,
 * но также описывают шаблоны для передачи сообщений / связи между ними.
 * Или, другими словами, они помогают ответить на вопрос «Как запустить поведение в программном компоненте?»
 *
 * @author Igor Fedorenko (mailto:if.zommy@gmail.com)
 * @version $Id$
 * @since 0.1
 */
package ru.job4j.patterns.behavioral;